//
//  main.m
//  LeetCode
//
//  Created by zhouluyao on 2/22/23.
//

/************************** 题解 **********************
 题目链接：
 题目大意：
 构造排列
 从n个不同元素中任取 m(m<=n)个元素，按照一定的顺序排列起来，叫做从n个不同元素中取出 m 个元素的一个排列。当 m=n 时所有的排列情况叫全排列。
 现在想要从1...N 这N个数的全排列中找到一种排列，使其第L位到第R位的和为S，求任意合法排
 列，若没有合法排列则输出-1。

 
 
 样例 1：
 N=5，L=3，R=5，S=8
 样例1输出
3，4，5，2，1
(也可以是[5，2，4，3，1]，[5，2，1，4，3]等任意合法排列)
 
  样例2
 N=5，L=3，R=4，S=1
 
  样例2输出
  -1
 
  样例3
  N=2，L=2，R=2，S=2
  样例3输出
  1，2
 ————————————————

 
 题目解析：
在一个N*N 的棋盘上，同一个棋子3个相同的相连接的情况无非有4种情况

 
 网上其他的做法：
 */

#import <Foundation/Foundation.h>


int main(int argc, const char * argv[]) {
    @autoreleasepool {
        // insert code here...
        NSLog(@"Hello, World!");
    }
    return 0;
}
